# slim обозначает, что мы запрашиваем более легковесную версию без дополнительных утилит (здесь её хватит)
FROM python:3.12-slim

# Создаем рабочую директорию
WORKDIR /app

# Наполняем рабочую директорию. Путь не прописываем, так как обафайла лежат рядом, в корневой директории
COPY /requirements.txt /

# Устанавливаем все зависимости
# --no-cash-dir эту информацию добаваляем, чтобы у нас не кэшировался список зависимостей, а всегда обновлялся актуальный
#RUN pip install -r /requirements.txt --no-cash-dir
RUN pip install --no-cache-dir -r /requirements.txt

# Копируем наше приложение (то есть всю информацию из текущей директории в рабочую)
COPY . .

# Команда для запуска приложения при старте контейнера для постановки знака комбинация клавиш (Alt+38)
# sh - настройка работы с оболочками
#CMD ["sh", "-c", "python manage.py migrate && python manage.py runserver 0.0.0.0:8000"]
# !!! КОМАНДА была перенесена в файл docker-compose.yaml, поэтому отсюда её удаляем